Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
/*
 * Copyright 2022, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/** @file
 *  Implementation of Secure Sockets Interface for NetXDuo.
 *
 */

#include "cy_secure_sockets.h"
#include "cy_tls.h"
#include "cyabs_rtos.h"
#include "cy_worker_thread.h"
#include "cyabs_rtos_impl.h"
#include "cy_network_mw_core.h"
#include "cy_network_buffer.h"
#include "cy_log.h"
#include "nx_api.h"
#include "nx_packet.h"


#ifndef DEFAULT_TCP_WINDOW_SIZE
#define DEFAULT_TCP_WINDOW_SIZE             (7 * 1024)
#endif

#ifndef DEFAULT_UDP_QUEUE_SIZE
#define DEFAULT_UDP_QUEUE_SIZE              (5)
#endif

#ifndef DEFAULT_PACKET_ALLOCATE_TIMEOUT
#define DEFAULT_PACKET_ALLOCATE_TIMEOUT     (2 * 1000)
#endif

#ifndef DEFAULT_BIND_TIMEOUT
#define DEFAULT_BIND_TIMEOUT                (1000)
#endif

#ifndef DEFAULT_ACCEPT_TIMEOUT
#define DEFAULT_ACCEPT_TIMEOUT              (3000)
#endif

#ifndef DEFAULT_DNS_TIMEOUT
#define DEFAULT_DNS_TIMEOUT                 (3000)
#endif

#ifdef NX_DISABLE_PACKET_CHAIN
#define FRAGMENT_OPTION                     NX_DONT_FRAGMENT
#else
#define FRAGMENT_OPTION                     NX_FRAGMENT_OKAY
#endif

typedef struct cy_socket_ctx cy_socket_ctx_t;


/* Macro to get the cy_socket_context pointer from tcp/udp field's address */
#define CY_NETXDUO_GET_SOCKET_CONTEXT(addr,type,field) ((type*)((unsigned char*)addr - (unsigned long)&((type*)NULL)->nxd_socket.field))

struct cy_socket_ctx
{
    uint32_t              socket_magic_header;    /**< Socket context magic header to verify the context pointer */
    union
    {
        NX_TCP_SOCKET     *tcp;                   /**< NetXDuo TCP socket structure */
        NX_UDP_SOCKET     *udp;                   /**< NetXDuo UDP socket structure */
    } nxd_socket;
    cy_mutex_t            socket_mutex;           /**<* Protects accessing the socket context */
    struct
    {
        cy_socket_opt_callback_t connect_request;
        cy_socket_opt_callback_t receive;
        cy_socket_opt_callback_t disconnect;
    } callbacks;                                          /**<* Socket callback functions */
    void*                 tls_ctx;                        /**< tls context of underlying security stack */
    const void*           tls_identity;                   /**< contains certificate/key pair */
    char*                 rootca_certificate;             /**< RootCA certificate specific to the socket */
    int                   rootca_certificate_len;         /**< Length of ca_cert */
    bool                  enforce_tls;                    /**< Enforce TLS connection */
    int                   auth_mode;                      /**< TLS authentication mode */
    unsigned char         mfl_code;                       /**< TLS maximum fragment length */
    char*                 alpn;                           /**< ALPN string */
    char**                alpn_list;                      /**< ALPN array of strings to be passed to mbedtls */
    uint32_t              alpn_count;                     /**< Number of protocols in ALPN list */
    char*                 hostname;                       /**< Server hostname used with SNI extension */
    uint32_t              status;                         /**< socket status */
    NX_PACKET*            packet;                         /**< Receive data \c NX_PACKET structure */
    uint16_t              offset;                         /**< Receive data \c NX_PACKET  offset */
    uint16_t              bind_port;                      /**< Port number for listen requests */
    int                   id;                             /**< Socket id used in mapping from netconn to cy socket */
    int                   role;                           /**< Used for identifying if the socket is server or client */
    int                   transport_protocol;             /**< Used for identifying transport protocol TCP, TLS or UDP */
    bool                  is_recvtimeout_set;             /**< Used to check whether receive timeout is set by the application */
    uint32_t              recv_timeout;                   /**< Socket receive timeout in milliseconds */
    uint32_t              send_timeout;                   /**< Socket send timeout in milliseconds */
    bool                  nonblocking;                    /**< Socket is nonblocking */
    bool                  is_authmode_set;                /**< Used to check whether TLS authentication mode is set by the application */
    cy_socket_interface_t iface_type;                     /**< Network interface to be used with the socket */
#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
    bool                  load_rootca_from_ram;           /**< Flag for setting the RootCA certificate location.  */
    bool                  load_device_cert_key_from_ram;  /**< Flag for setting the device cert & key location. */
#endif
    uint32_t              socket_magic_footer;            /**< Socket context magic footer to verify the context pointer */
};

