Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
/*
 * This structure is queued to worker thread to process all the receive events occurred before socket context is created for accepted client socket.
 */
typedef struct cy_socket_recv_events
{
    uint32_t recv_count;
    cy_socket_ctx_t *socket;
} cy_socket_recv_event_t;

typedef struct cy_socket_multicast_pair
{
    cy_socket_ctx_t       *socket;         /**< Socket */
    cy_socket_ip_address_t if_addr;        /**< Interface IP address */
    cy_socket_ip_address_t multi_addr;     /**< multicast group address */
} cy_socket_multicast_pair_t;

/* Used to keep track of the registered multicast members */
typedef struct cy_socket_multicast_info
{
    cy_socket_multicast_pair_t *multicast_member_list;      /**< List of multicast addresses registered */
    uint32_t                    multicast_member_status;    /**< Each bit in this member indicates status of corresponding entry in multicast_member_list. */
    uint8_t                     multicast_member_count;     /**< Number of multicast addresses registered */
} cy_socket_multicast_info_t;

static cy_socket_multicast_info_t multicast_info;

/* Mutex to protect the multicast info */
static cy_mutex_t multicast_join_leave_mutex;

typedef enum
{
    SOCKET_STATUS_FLAG_CONNECTED = 0x1, /* TCP socket connection is established with peer */
    SOCKET_STATUS_FLAG_SECURED   = 0x2, /* Secure TLS connection is establisher with peer */
    SOCKET_STATUS_FLAG_LISTENING = 0x4  /* Server socket is ready for client connections */
} cy_socket_status_flag_t;

#define SECURE_SOCKETS_MAX_FRAG_LEN_NONE    0
#define SECURE_SOCKETS_MAX_FRAG_LEN_512     1
#define SECURE_SOCKETS_MAX_FRAG_LEN_1024    2
#define SECURE_SOCKETS_MAX_FRAG_LEN_2048    3
#define SECURE_SOCKETS_MAX_FRAG_LEN_4096    4
#define SECURE_SOCKETS_MAX_FRAG_LEN_INVALID 5

/* Secure sockets thread stack size */
#ifndef SECURE_SOCKETS_THREAD_STACKSIZE
#define SECURE_SOCKETS_THREAD_STACKSIZE    (6 * 1024)
#endif

/* Sleep time in each loop while waiting for ARP resolution */
#define ARP_CACHE_CHECK_INTERVAL_IN_MSEC    5

#define NUM_SOCKETS                         (16)

#define SECURE_SOCKETS_MAGIC_HEADER         0xbaefdcbd
#define SECURE_SOCKETS_MAGIC_FOOTER         0xefbcabfe

/* Maximum number of multicast groups supported. */
#define SECURE_SOCKETS_MAX_MULTICAST_GROUPS 10

#define UNUSED_ARG(arg)                     (void)(arg)

#define NXD_TO_CY_SECURE_SOCKETS_ERR( nxd_err )     ( nxd_to_secure_socket_error(nxd_err) )
#define TLS_TO_CY_SECURE_SOCKETS_ERR( tls_err )     ( tls_to_secure_socket_error(tls_err) )

#ifdef ENABLE_SECURE_SOCKETS_LOGS
#define ss_cy_log_msg cy_log_msg
#else
#define ss_cy_log_msg(a,b,c,...)
#endif

#define IN_RANGE(x, min, max)               ((uint8_t)(x) >= (min) && (uint8_t)(x) <= (max))
#define IS_LOWERCASE(x)                     IN_RANGE((x), 'a', 'z')
#define IS_DIGIT(x)                         IN_RANGE((x), '0', '9')
#define IS_HEX_DIGIT(x)                     (IS_DIGIT(x) || IN_RANGE((x), 'a', 'f') || IN_RANGE((x), 'A', 'F'))
#define IPV6_SEGMENT_CNT                    8

typedef struct cy_nxd_sock
{
    int used;
    cy_socket_ctx_t *ctx;
} cy_nxd_sock_t;

/** mutex to protect socket array */
static cy_mutex_t socket_list_mutex;

/* mutex to protect the counter maintained for receive events occurred
 * on an accepted socket, prior to socket context is created for it.
 */
static cy_mutex_t accept_recv_event_mutex;
static cy_worker_thread_info_t socket_worker;

/* Socket library usage count */
static int init_ref_count = 0;

/** The global array of available sockets */
static cy_nxd_sock_t socket_list[NUM_SOCKETS];

static bool is_socket_valid(cy_socket_ctx_t *socket)
{
    if ((socket->socket_magic_header == SECURE_SOCKETS_MAGIC_HEADER) && (socket->socket_magic_footer == SECURE_SOCKETS_MAGIC_FOOTER))
    {
        return true;
    }
    return false;
}

static cy_rslt_t convert_nxd_to_secure_socket_ip_addr(cy_socket_ip_address_t *dest, const NXD_ADDRESS *src)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    memset(dest, 0, sizeof(cy_socket_ip_address_t));

#if defined(NX_DISABLE_IPV6) && defined(NX_DISABLE_IPV4)

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "NX_DISABLE_IPV6 and NX_DISABLE_IPV4 are both defined\n");
    result = CY_RSLT_MODULE_SECURE_SOCKETS_BAD_NW_STACK_CONFIGURATION;

#else

    /*
     * NetXDuo APIs use host byte order for addresses. cy_socket_ip_address_t structures
     * use network byte order so we need to do the proper conversion.
     */

    if (src->nxd_ip_version == NX_IP_VERSION_V4)
    {
#ifndef NX_DISABLE_IPV4
        dest->version = CY_SOCKET_IP_VER_V4;
        dest->ip.v4   = htonl(src->nxd_ip_address.v4);
#endif
    }
    else if (src->nxd_ip_version == NX_IP_VERSION_V6)
    {
#ifndef NX_DISABLE_IPV6
        dest->version  = CY_SOCKET_IP_VER_V6;
        dest->ip.v6[0] = htonl(src->nxd_ip_address.v6[0]);
        dest->ip.v6[1] = htonl(src->nxd_ip_address.v6[1]);
        dest->ip.v6[2] = htonl(src->nxd_ip_address.v6[2]);
        dest->ip.v6[3] = htonl(src->nxd_ip_address.v6[3]);
#endif
    }
    else
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid IP version type\n");
        result = CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

#endif

    return result;
}

static cy_rslt_t convert_secure_socket_to_nxd_ip_addr(NXD_ADDRESS *dest, const cy_socket_ip_address_t *src)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    memset(dest, 0, sizeof(NXD_ADDRESS));

#if defined(NX_DISABLE_IPV6) && defined(NX_DISABLE_IPV4)

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "NX_DISABLE_IPV6 and NX_DISABLE_IPV4 are both defined\n");
    result = CY_RSLT_MODULE_SECURE_SOCKETS_BAD_NW_STACK_CONFIGURATION;

#else

    /*
     * NetXDuo APIs use host byte order for addresses. cy_socket_ip_address_t structures
     * use network byte order so we need to do the proper conversion.
     */

    if (src->version == CY_SOCKET_IP_VER_V4)
    {
#ifndef NX_DISABLE_IPV4
        dest->nxd_ip_version    = NX_IP_VERSION_V4;
        dest->nxd_ip_address.v4 = ntohl(src->ip.v4);
#endif
    }
    else if (src->version == CY_SOCKET_IP_VER_V6)
    {
#ifndef NX_DISABLE_IPV6
        dest->nxd_ip_version       = NX_IP_VERSION_V6;
        dest->nxd_ip_address.v6[0] = ntohl(src->ip.v6[0]);
        dest->nxd_ip_address.v6[1] = ntohl(src->ip.v6[1]);
        dest->nxd_ip_address.v6[2] = ntohl(src->ip.v6[2]);
        dest->nxd_ip_address.v6[3] = ntohl(src->ip.v6[3]);
#endif
    }
    else
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid IP version type\n");
        result = CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

#endif

    return result;
}

