Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
static bool ip_addr_ismulticast(NXD_ADDRESS *addr)
{
    if (addr == NULL)
    {
        return false;
    }

    if (addr->nxd_ip_version == NX_IP_VERSION_V4)
    {
        /*
         * IPv4 multicast addresses are Class D.
         */

        if ((addr->nxd_ip_address.v4 & 0xF0000000UL) == 0xE0000000UL)
        {
            return true;
        }
    }
#ifndef NX_DISABLE_IPV6
    else if (addr->nxd_ip_version == NX_IP_VERSION_V6)
    {
        /*
         * IPv6 multicast addresses have the top 8 bits set.
         */

        if ((addr->nxd_ip_address.v6[0] & 0xFF000000UL) == 0xFF000000UL)
        {
            return true;
        }
    }
#endif
    return false;
}

static bool ip_addrs_same(NXD_ADDRESS *addr1, NXD_ADDRESS *addr2)
{
    if (addr1 == NULL || addr2 == NULL)
    {
        return false;
    }

    if (addr1->nxd_ip_version != addr2->nxd_ip_version)
    {
        return false;
    }

    if (addr1->nxd_ip_version == NX_IP_VERSION_V4 && addr1->nxd_ip_address.v4 != addr2->nxd_ip_address.v4)
    {
        return false;
    }
#ifndef NX_DISABLE_IPV6
    if (addr1->nxd_ip_version == NX_IP_VERSION_V6 &&
        (addr1->nxd_ip_address.v6[0] != addr2->nxd_ip_address.v6[0] || addr1->nxd_ip_address.v6[1] != addr2->nxd_ip_address.v6[1] ||
         addr1->nxd_ip_address.v6[2] != addr2->nxd_ip_address.v6[2] || addr1->nxd_ip_address.v6[3] != addr2->nxd_ip_address.v6[3]))
    {
        return false;
    }
#endif
    return true;
}

static bool str_to_ip(const char *str, uint32_t *addr)
{
    uint8_t byte = 0;
    uint8_t byte_cnt = 1;
    uint32_t ip_addr = 0;
    char ch;

    if (str == NULL || addr == NULL)
    {
        return false;
    }

    if (strlen(str) > 15)
    {
        return false;
    }

    while (*str != '\0' || byte_cnt <= 4)
    {
        ch = *str;
        if (ch == '.' || ch == '\0')
        {
            if (byte_cnt == 1 && ch == '.')
            {
                ip_addr = ip_addr | (((uint32_t)byte) << 0);
            }
            else if (byte_cnt == 2 && ch == '.')
            {
                ip_addr = ip_addr | (((uint32_t)byte) << 8);
            }
            else if (byte_cnt == 3 && ch == '.')
            {
                ip_addr = ip_addr | (((uint32_t)byte) << 16);
            }
            else if(byte_cnt == 4 && ch == '\0')
            {
                ip_addr = ip_addr | (((uint32_t)byte) << 24);
                break;
            }
            else
            {
                break;
            }
            byte = 0;
            byte_cnt++;
            str++;
            continue;
        }
        byte = (byte * 10) + (ch - '0');
        str++;
    }
    if (byte_cnt < 4)
    {
        return false;
    }
    *addr = ip_addr;

    return true;
}
#ifndef NX_DISABLE_IPV6
static bool str_to_ipv6(const char *str, uint32_t *ipv6_addr)
{
    uint32_t addr_idx, zero_segment_cnt, curr_segment_idx, curr_segment_val;
    const char *ch;

    if(str == NULL || ipv6_addr == NULL)
    {
        return false;
    }

    /* To get the number of segments in a "::" sequence, count the number of colons.
       'zero_segment_cnt' can be 1 even if there are no :: sequences in the given IPv6 address string */
    zero_segment_cnt = IPV6_SEGMENT_CNT;

    for (ch = str; *ch != 0; ch++)
    {
        if(*ch == ':')
        {
            zero_segment_cnt--;
        }
        else if(!IS_HEX_DIGIT(*ch))
        {
            return false;
        }
    }

    /* parsing each segment */
    addr_idx = 0;
    curr_segment_idx = 0;
    curr_segment_val = 0;
    for (ch = str; *ch != 0; ch++)
    {
        if (*ch == ':')
      	{
            if (curr_segment_idx & 0x1)
            {
                ipv6_addr[addr_idx++] |= curr_segment_val;
            }        
            else
            {
                ipv6_addr[addr_idx] = curr_segment_val << 16; 
            }

            curr_segment_idx++;
            curr_segment_val = 0;

            if (curr_segment_idx > (IPV6_SEGMENT_CNT - 1))
            {
                /* address too long - More than 8 segments in IPv6 Address */
                return false;
            }
            if (ch[1] == ':')
            {
                if (ch[2] == ':')
                {
                    /* 3 successive colons in IPv6 address is invalid format */
                    return false;
                }
                ch++;
                /* Once "::" is found, set zeros */
                while (zero_segment_cnt > 0)
                {
                    zero_segment_cnt--;
                    if (curr_segment_idx & 0x1)
                    {
                        addr_idx++;
                    }  
                    else
                    {
                        ipv6_addr[addr_idx] = 0;        
                    }
                    
                    curr_segment_idx++;
                    if (curr_segment_idx > (IPV6_SEGMENT_CNT-1))
                    {
                        /* address too long - More than 8 segments in IPv6 Address */
                        return false;
                    }
                }
            }
        }
        else if (IS_HEX_DIGIT(*ch))
        {
            /* Add current digit */
            curr_segment_val = (curr_segment_val << 4) + (IS_DIGIT(*ch) ? (uint32_t)(*ch - '0') : (uint32_t)(10 + (IS_LOWERCASE(*ch) ? *ch - 'a' : *ch - 'A')));
        }
        else
        {
            /* Unexpected character */
            return false;
        }
    }

    if (curr_segment_idx & 0x1)
    {
        ipv6_addr[addr_idx++] |= curr_segment_val;
    }        

    if (curr_segment_idx != (IPV6_SEGMENT_CNT-1))
    {
        return false;
    }    

    return true;
}
#endif

static cy_rslt_t nxd_packet_get_data(NX_PACKET *packet, uint16_t offset, uint8_t **data, uint16_t *fragment_available_data_length, uint16_t *total_available_data_length)
{
    NX_PACKET* first_packet      = packet;
    NX_PACKET* iter              = packet;
    uint16_t   requested_offset  = offset;
    uint16_t   fragment_length;

    if (packet == NULL || data == NULL || fragment_available_data_length == NULL || total_available_data_length == NULL)
    {
        return CY_RSLT_MODULE_SECURE_SOCKETS_TCPIP_ERROR;
    }

