Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
    while (iter != NULL)
    {
        /* It is more appropriate to use the difference between nx_packet_append_ptr and nx_packet_prepend_ptr rather
         * than nx_packet_length. If the packet was fragmented the nx_packet_length will reflect the sum of the data length of all
         * fragments, not the length of the fragment alone */

        fragment_length = (uint16_t)(iter->nx_packet_append_ptr - iter->nx_packet_prepend_ptr);
        if (iter->nx_packet_length == 0)
        {
            *data                           = NULL;
            *fragment_available_data_length = 0;
            *total_available_data_length    = 0;

            return CY_RSLT_SUCCESS;
        }
        else if (offset < fragment_length)
        {
            *data = iter->nx_packet_prepend_ptr + offset;
            *fragment_available_data_length = (uint16_t)(iter->nx_packet_append_ptr - *data);

            /* This will give number of bytes available after this offset including this packet and further packets in the chain */
            *total_available_data_length    = (uint16_t)(first_packet->nx_packet_length - requested_offset);

            return CY_RSLT_SUCCESS;
        }
        else
        {
            offset = (uint16_t)(offset - (iter->nx_packet_append_ptr - iter->nx_packet_prepend_ptr));
        }
        iter = iter->nx_packet_next;
    }

    return CY_RSLT_MODULE_SECURE_SOCKETS_TCPIP_ERROR;
}

/* Find the index of the next registered slot in the multicast list. Caller should ensure to call
 * this helper function only when at-least one member is registered, else the while will become indefinite.
 * This function should be called under a mutex lock. */
static uint32_t next_registered_multicast_slot(uint32_t index)
{
    while (!(multicast_info.multicast_member_status & (0x0001 << index)))
    {
        index++;
    }
    return index;
}

/* Find the index of the next free slot in the multicast list. Ensure to call this function only when the
 * total registered count is not reached the maximum. This function should be called under a mutex lock. */
static uint32_t next_free_multicast_slot(uint32_t index)
{
    while (multicast_info.multicast_member_status & (0x0001 << index))
    {
        index++;
    }
    return index;
}

/* Set the status of the given input slot in the multicast list. This function should be called under a mutex lock. */
static void set_multicast_slot_status_bit(uint32_t index)
{
    multicast_info.multicast_member_status |= (0x0001 << index);
}

/* Clear the status of the given input slot in the multicast list. This function should be called under a mutex lock. */
static void clear_multicast_slot_status_bit(uint32_t index)
{
    multicast_info.multicast_member_status &= ~(0x0001 << index);
}

/* Find the index of the given input member in the multicast list. */
static int find_multicast_member_index(cy_socket_ctx_t *socket, const cy_socket_ip_mreq_t *imr)
{
    uint32_t count = 0;
    uint32_t index = 0;

    while (count < multicast_info.multicast_member_count)
    {
        index = next_registered_multicast_slot(index);

        if( memcmp(&multicast_info.multicast_member_list[index].multi_addr, &imr->multi_addr, sizeof(imr->multi_addr)) == 0 &&
            memcmp(&multicast_info.multicast_member_list[index].if_addr, &imr->if_addr, sizeof(imr->if_addr)) == 0 &&
            multicast_info.multicast_member_list[index].socket == socket )
        {
            return index;
        }
        count++;
        index++;
    }

    return -1;
}

static cy_socket_ctx_t *alloc_socket(int protocol, cy_socket_interface_t iface_type)
{
    int i;
    cy_rslt_t result;

    /* allocate a new socket identifier */
    for (i = 0; i < NUM_SOCKETS; ++i)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex locked %s %d\n", __FILE__, __LINE__);
        cy_rtos_get_mutex(&socket_list_mutex, CY_RTOS_NEVER_TIMEOUT);
        if (!socket_list[i].ctx)
        {
            if (socket_list[i].used)
            {
                cy_rtos_set_mutex(&socket_list_mutex);
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\n", __FILE__, __LINE__);
                continue;
            }
            socket_list[i].ctx = malloc(sizeof(cy_socket_ctx_t));
            if (socket_list[i].ctx == NULL)
            {
                cy_rtos_set_mutex(&socket_list_mutex);
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\n", __FILE__, __LINE__);
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "malloc failed %s %d\n", __FILE__, __LINE__);
                return NULL;
            }

            memset(socket_list[i].ctx, 0, sizeof(cy_socket_ctx_t));

            /*
             * Allocate the NetXDuo socket structure.
             */

            if (protocol == CY_SOCKET_IPPROTO_UDP)
            {
                socket_list[i].ctx->nxd_socket.udp = calloc(1, sizeof(NX_UDP_SOCKET));
            }
            else
            {
                socket_list[i].ctx->nxd_socket.tcp = calloc(1, sizeof(NX_TCP_SOCKET));
            }

            /*
             * Since the socket pointers are a union, we only need to check one member to see if the alloc was successful.
             */

            if (socket_list[i].ctx->nxd_socket.udp == NULL)
            {
                free(socket_list[i].ctx);
                socket_list[i].ctx = NULL;

                cy_rtos_set_mutex(&socket_list_mutex);
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\n", __FILE__, __LINE__);

                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "socket alloc failed at file: %s line: %d\n", __FILE__, __LINE__);
                return NULL;
            }

            result = cy_rtos_init_mutex(&socket_list[i].ctx->socket_mutex);
            if (CY_RSLT_SUCCESS != result)
            {
                free(socket_list[i].ctx->nxd_socket.udp);
                socket_list[i].ctx->nxd_socket.udp = NULL;
                free(socket_list[i].ctx);
                socket_list[i].ctx = NULL;

                cy_rtos_set_mutex(&socket_list_mutex);
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);

                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_rtos_init_mutex failed at file: %s line: %d error code: %ld\n", __FILE__, __LINE__, result);
                return NULL;
            }

            socket_list[i].used = 1;
            socket_list[i].ctx->id = i;
            socket_list[i].ctx->role = CY_TLS_ENDPOINT_CLIENT;
            socket_list[i].ctx->iface_type = iface_type;
            socket_list[i].ctx->transport_protocol  = protocol;
            socket_list[i].ctx->socket_magic_header = SECURE_SOCKETS_MAGIC_HEADER;
            socket_list[i].ctx->socket_magic_footer = SECURE_SOCKETS_MAGIC_FOOTER;

            cy_rtos_set_mutex(&socket_list_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\n", __FILE__, __LINE__);
            return socket_list[i].ctx;
        }
        else
        {
            cy_rtos_set_mutex(&socket_list_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\n", __FILE__, __LINE__);
        }
    }

