Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
    return NULL;
}

static void free_socket(cy_socket_ctx_t *socket)
{
    int id;

    if (socket == NULL)
    {
        return;
    }

    id = socket->id;
    if (id >= 0 && id < NUM_SOCKETS)
    {
        /* update the sockets array */
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex locked %s %d\r\n", __FILE__, __LINE__);
        cy_rtos_get_mutex(&socket_list_mutex, CY_RTOS_NEVER_TIMEOUT);
        cy_rtos_deinit_mutex(&socket->socket_mutex);
        socket_list[id].used = 0;

        /*
         * Socket pointers are a union so we only need to check one.
         */

        if (socket_list[id].ctx->nxd_socket.tcp)
        {
            free(socket_list[id].ctx->nxd_socket.tcp);
            socket_list[id].ctx->nxd_socket.tcp = NULL;
        }

        memset(socket_list[id].ctx, 0, sizeof(cy_socket_ctx_t));
        socket_list[id].ctx = NULL;
        cy_rtos_set_mutex(&socket_list_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);
    }

    /* free the socket memory */
    free(socket);
}

static unsigned char max_fragment_length_to_mfl_code(uint32_t max_fragment_length)
{
    unsigned char mfl;
    switch (max_fragment_length)
    {
        case 0:
        {
            mfl = SECURE_SOCKETS_MAX_FRAG_LEN_NONE;
            break;
        }
        case 512:
        {
            mfl = SECURE_SOCKETS_MAX_FRAG_LEN_512;
            break;
        }
        case 1024:
        {
            mfl = SECURE_SOCKETS_MAX_FRAG_LEN_1024;
            break;
        }
        case 2048:
        {
            mfl = SECURE_SOCKETS_MAX_FRAG_LEN_2048;
            break;
        }
        case 4096:
        {
            mfl = SECURE_SOCKETS_MAX_FRAG_LEN_4096;
            break;
        }
        default:
        {
            mfl = SECURE_SOCKETS_MAX_FRAG_LEN_INVALID;
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid maximum fragment length\n");
        }
    }
    return mfl;
}

static uint32_t mfl_code_to_max_fragment_length(unsigned char mfl_code)
{
    uint32_t max_fragment_length=0;;

    switch (mfl_code)
    {
        case SECURE_SOCKETS_MAX_FRAG_LEN_NONE:
        {
            max_fragment_length = 0;
            break;
        }
        case SECURE_SOCKETS_MAX_FRAG_LEN_512:
        {
            max_fragment_length = 512;
            break;
        }
        case SECURE_SOCKETS_MAX_FRAG_LEN_1024:
        {
            max_fragment_length = 1024;
            break;
        }
        case SECURE_SOCKETS_MAX_FRAG_LEN_2048:
        {
            max_fragment_length = 2048;
            break;
        }
        case SECURE_SOCKETS_MAX_FRAG_LEN_4096:
        {
            max_fragment_length = 4096;
            break;
        }
        default:
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid mflcode %d\n", mfl_code);
        }
    }
    return max_fragment_length;
}

static cy_rslt_t nxd_to_secure_socket_error(UINT error)
{
    switch (error)
    {
        case NX_SUCCESS:
            return CY_RSLT_SUCCESS;

        case NX_PTR_ERROR:
            return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;

//        case ERR_CLSD:
//            return CY_RSLT_MODULE_SECURE_SOCKETS_CLOSED;

        case NX_NO_PACKET:
            return CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT;

//        case ERR_TIMEOUT:
//            return CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT;

        case NX_IN_PROGRESS:
            return CY_RSLT_MODULE_SECURE_SOCKETS_IN_PROGRESS;

//        case ERR_ISCONN:
//            return CY_RSLT_MODULE_SECURE_SOCKETS_ALREADY_CONNECTED;

        case NX_NOT_CONNECTED:
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_CONNECTED;

//        case ERR_ARG:
//        case ERR_VAL:
//            return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;

//        case ERR_USE:
//            return CY_RSLT_MODULE_SECURE_SOCKETS_ADDRESS_IN_USE;

//        case ERR_RTE:
//            return CY_RSLT_MODULE_SECURE_SOCKETS_ERROR_ROUTING;

//        case ERR_BUF:
//        case ERR_WOULDBLOCK:
//        case ERR_IF:
        default:
            printf("NetXDuo error: 0x%02x\n", error);
            return CY_RSLT_MODULE_SECURE_SOCKETS_TCPIP_ERROR;
    }
}

static cy_rslt_t tls_to_secure_socket_error(cy_rslt_t error)
{
    switch (error)
    {
        case CY_RSLT_SUCCESS:
            return CY_RSLT_SUCCESS;

        case CY_RSLT_MODULE_TLS_BADARG:
            return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;

        case CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE:
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;

        case CY_RSLT_MODULE_TLS_CONNECTION_CLOSED:
            return CY_RSLT_MODULE_SECURE_SOCKETS_CLOSED;

        case CY_RSLT_MODULE_TLS_SOCKET_NOT_CONNECTED:
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_CONNECTED;

        case CY_RSLT_MODULE_TLS_TIMEOUT:
            return CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT;

        case CY_RSLT_MODULE_TLS_PKCS_ERROR:
            return CY_RSLT_MODULE_SECURE_SOCKETS_PKCS_ERROR;

        case CY_RSLT_MODULE_TLS_PARSE_CERTIFICATE:
        case CY_RSLT_MODULE_TLS_PARSE_KEY:
        case CY_RSLT_MODULE_TLS_ERROR:
        default:
            return CY_RSLT_MODULE_SECURE_SOCKETS_TLS_ERROR;
    }
}

static cy_rslt_t secure_socket_to_tls_error(cy_rslt_t error)
{
    switch (error)
    {
        case CY_RSLT_SUCCESS:
            return CY_RSLT_SUCCESS;

        case CY_RSLT_MODULE_SECURE_SOCKETS_BADARG:
            return CY_RSLT_MODULE_TLS_BADARG;

        case CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM:
            return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;

        case CY_RSLT_MODULE_SECURE_SOCKETS_CLOSED:
            return CY_RSLT_MODULE_TLS_CONNECTION_CLOSED;

        case CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT:
            return CY_RSLT_MODULE_TLS_TIMEOUT;

        case CY_RSLT_MODULE_SECURE_SOCKETS_NOT_CONNECTED:
            return CY_RSLT_MODULE_TLS_SOCKET_NOT_CONNECTED;

        default:
            return CY_RSLT_MODULE_TLS_ERROR;
    }
}

