Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
/* 'nx_tcp_socket_bytes_available' does not indicate bytes available when socket is not in connected state.
 * It is possible that the peer device sends data and immediately closes the connection. In this case, bytes
 * are available to be processed even though the socket is no longer in a connected state.
 * Hence using a modified implementation to check if bytes are available to be received.
 */

static bool is_nx_tcp_bytes_available(NX_TCP_SOCKET *socket_ptr)
{
    NX_IP         *ip_ptr;
    NX_PACKET     *packet_ptr;
    bool is_bytes_available = false;

    if(socket_ptr == NULL || socket_ptr->nx_tcp_socket_state <= NX_TCP_LISTEN_STATE)
    {
        return false;
    }

    /* Setup IP pointer. */
    ip_ptr = socket_ptr->nx_tcp_socket_ip_ptr;
    if(ip_ptr == NULL)
    {
        return false;
    }

    /* Obtain the IP mutex so we can examine the bound port.  */
    tx_mutex_get(&(ip_ptr->nx_ip_protection), TX_WAIT_FOREVER);

    packet_ptr = socket_ptr->nx_tcp_socket_receive_queue_head;

    if (packet_ptr != NX_NULL)
    {
        /* The receive queue is not empty.
         * There are bytes in the rx queue that are available to the applciation.
         */
        if (packet_ptr->nx_packet_queue_next == ((NX_PACKET *)NX_PACKET_READY))
        {
            is_bytes_available = true;
        }
    }
    tx_mutex_put(&(ip_ptr -> nx_ip_protection));

    return is_bytes_available;
}

/* Check if a given TCP socket's TX queue is available for sending data */
static bool is_nx_tcp_send_available(NX_TCP_SOCKET *socket_ptr)
{
    NX_IP         *ip_ptr;
    bool          is_tx_queue_free = false;

    if(socket_ptr == NULL)
    {
        return false;
    }

    /* Setup IP pointer. */
    ip_ptr = socket_ptr->nx_tcp_socket_ip_ptr;
    if(ip_ptr == NULL)
    {
        return false;
    }

    /* Obtain the IP mutex so we can examine the bound port.  */
    tx_mutex_get(&(ip_ptr->nx_ip_protection), TX_WAIT_FOREVER);

    /* Make sure the TCP socket is in a connected state. */
    if ((socket_ptr -> nx_tcp_socket_state <= NX_TCP_LISTEN_STATE) ||
        (socket_ptr -> nx_tcp_socket_state > NX_TCP_ESTABLISHED))
    {
        /* Release protection.  */
        tx_mutex_put(&(ip_ptr -> nx_ip_protection));

        return false;
    }

    /* Check if there is room in tcp transmit queue to send more data. */
    if(socket_ptr->nx_tcp_socket_transmit_sent_count < socket_ptr->nx_tcp_socket_transmit_queue_maximum)
    {
        is_tx_queue_free = true;
    }
    else
    {
        is_tx_queue_free = false;
    }

    /* Release protection.  */
    tx_mutex_put(&(ip_ptr -> nx_ip_protection));

    return is_tx_queue_free;
}

/* Check if a given UDP socket is available for sending data. */ 
static bool is_nx_udp_send_available(NX_UDP_SOCKET *socket_ptr)
{
    /* There is no queuing of data in UDP sockets. Data can be sent if the socket is bound to a port. */
    if (!socket_ptr->nx_udp_socket_bound_next)
    {
        return false;
    }
    else
    {
        return true;
    }
}

static void cy_process_receive_event_with_valid_context(cy_socket_ctx_t *ctx)
{
    NX_PACKET *packet;
    ULONG bytes_available;
    bool is_bytes_available;

    /*
     * Note this routine assumes the socket_list_mutex has been grabbed.
     */

    bytes_available = 0;
    if (ctx->transport_protocol == CY_SOCKET_IPPROTO_UDP)
    {
        if (ctx->callbacks.receive.callback)
        {
            /* For UDP transport protocol, check to find if receive data is available. */
            nx_udp_socket_bytes_available(ctx->nxd_socket.udp, &bytes_available);

            if (bytes_available > 0)
            {
                ctx->callbacks.receive.callback((cy_socket_t)ctx, ctx->callbacks.receive.arg);
            }
        }
    }
    else if( ( !ctx->enforce_tls && ( ctx->status & SOCKET_STATUS_FLAG_CONNECTED) ==  SOCKET_STATUS_FLAG_CONNECTED ) ||
             ( ( ctx->status & SOCKET_STATUS_FLAG_SECURED) ==  SOCKET_STATUS_FLAG_SECURED) )
    {
        /* If the transport protocol is TCP or TLS invoke application's receive callback function only if the connection is established.
         * The above check is needed for TLS connection so that we do not invoke app's receive callback for TLS handshake messages.
         */
        if (ctx->callbacks.receive.callback)
        {
            is_bytes_available = is_nx_tcp_bytes_available(ctx->nxd_socket.tcp);
            if (is_bytes_available)
            {
                ctx->callbacks.receive.callback((cy_socket_t)ctx, ctx->callbacks.receive.arg);
            }
            else
            {
                /* NetXDuo receive events are packet based, but secure socket APIs are stream based.
                 * If bytes_available is zero, still there can be received data left in the packet that is stored in
                 * the socket context. In that case even though bytes_available is zero application callback need be be invoked.
                 */

                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex locked %s %d\n", __FILE__, __LINE__);
                cy_rtos_get_mutex(&ctx->socket_mutex, CY_RTOS_NEVER_TIMEOUT);

                packet = ctx->packet;

                cy_rtos_set_mutex(&ctx->socket_mutex);
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                if (packet)
                {
                    ctx->callbacks.receive.callback((cy_socket_t)ctx, ctx->callbacks.receive.arg);
                }
            }
        }
    }
}

static void cy_process_disconnect_event(void *arg)
{
    NX_TCP_SOCKET *tcp = (NX_TCP_SOCKET *)arg;
    cy_socket_ctx_t *ctx;
    uint32_t id;

    if (tcp == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "NULL TCP socket %s %$d\n", __FILE__, __LINE__);
        return;
    }
    id = (uint32_t)tcp->nx_tcp_socket_reserved_ptr;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex locked %s %d\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&socket_list_mutex, CY_RTOS_NEVER_TIMEOUT);

    ctx = (cy_socket_ctx_t *)socket_list[id].ctx;

    if (ctx == NULL || !is_socket_valid(ctx))
    {
        cy_rtos_set_mutex(&socket_list_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\n", __FILE__, __LINE__);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "NULL or invalid context in cy_process_disconnect_event\n");
        return;
    }

    if (ctx->callbacks.disconnect.callback)
    {
        ctx->callbacks.disconnect.callback((cy_socket_t)ctx, ctx->callbacks.disconnect.arg);
    }

    cy_rtos_set_mutex(&socket_list_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\n", __FILE__, __LINE__);
}

static void cy_process_tcp_receive_event(void *arg)
{
    NX_TCP_SOCKET *tcp = (NX_TCP_SOCKET *)arg;
    cy_socket_ctx_t *ctx;
    uint32_t id;

    if (tcp == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "NULL TCP socket %s %d\n", __FILE__, __LINE__);
        return;
    }
    id = (uint32_t)tcp->nx_tcp_socket_reserved_ptr;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex locked %s %d\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&socket_list_mutex, CY_RTOS_NEVER_TIMEOUT);

    ctx = (cy_socket_ctx_t *)socket_list[id].ctx;

    if (ctx == NULL || !is_socket_valid(ctx))
    {
        cy_rtos_set_mutex(&socket_list_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\n", __FILE__, __LINE__);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "NULL or invalid context in cy_process_tcp_receive_event\n");
        return;
    }

    cy_process_receive_event_with_valid_context(ctx);

    cy_rtos_set_mutex(&socket_list_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\n", __FILE__, __LINE__);
}

