Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
static void cy_process_connect_event(void *arg)
{
    NX_TCP_SOCKET *tcp = (NX_TCP_SOCKET *)arg;
    cy_socket_ctx_t *ctx;
    uint32_t id;

    if (tcp == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "NULL TCP socket %s %d\n", __FILE__, __LINE__);
        return;
    }
    id = (uint32_t)tcp->nx_tcp_socket_reserved_ptr;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex locked %s %d\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&socket_list_mutex, CY_RTOS_NEVER_TIMEOUT);

    ctx = (cy_socket_ctx_t *)socket_list[id].ctx;

    if (ctx == NULL || !is_socket_valid(ctx))
    {
        cy_rtos_set_mutex(&socket_list_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\n", __FILE__, __LINE__);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "NULL or invalid context in cy_process_connect_event\n");
        return;
    }

    if (ctx->callbacks.connect_request.callback)
    {
        ctx->callbacks.connect_request.callback((cy_socket_t)ctx, ctx->callbacks.connect_request.arg);
    }

    cy_rtos_set_mutex(&socket_list_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\n", __FILE__, __LINE__);
}

static void cy_process_udp_receive_event(void *arg)
{
    NX_UDP_SOCKET *udp = (NX_UDP_SOCKET *)arg;
    cy_socket_ctx_t *ctx;
    uint32_t id;

    if (udp == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "NULL UDP socket %s %d\n", __FILE__, __LINE__);
        return;
    }
    id = (uint32_t)udp->nx_udp_socket_reserved_ptr;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex locked %s %d\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&socket_list_mutex, CY_RTOS_NEVER_TIMEOUT);

    ctx = (cy_socket_ctx_t *)socket_list[id].ctx;

    if (ctx == NULL || !is_socket_valid(ctx))
    {
        cy_rtos_set_mutex(&socket_list_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\n", __FILE__, __LINE__);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "NULL or invalid context in cy_process_udp_receive_event\n");
        return;
    }

    cy_process_receive_event_with_valid_context(ctx);

    cy_rtos_set_mutex(&socket_list_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\n", __FILE__, __LINE__);
}

static void cy_tcp_disconnect_callback(NX_TCP_SOCKET *socket)
{
    cy_rslt_t result;

    result = cy_worker_thread_enqueue(&socket_worker, cy_process_disconnect_event, (void *)socket);
    if (result != CY_RSLT_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_worker_thread_enqueue failed at file: %s line: %d with error: 0x%lx\r\n", __FILE__, __LINE__, result);
    }
}

static void cy_tcp_receive_callback(NX_TCP_SOCKET *socket)
{
    cy_rslt_t result;

    result = cy_worker_thread_enqueue(&socket_worker, cy_process_tcp_receive_event, (void *)socket);
    if (result != CY_RSLT_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_worker_thread_enqueue failed at file: %s line: %d with error: 0x%lx\r\n", __FILE__, __LINE__, result);
    }
}

static void cy_tcp_connect_callback(NX_TCP_SOCKET *socket, UINT port)
{
    cy_rslt_t result;

    result = cy_worker_thread_enqueue(&socket_worker, cy_process_connect_event, (void *)socket);
    if (result != CY_RSLT_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_worker_thread_enqueue failed at file: %s line: %d with error: 0x%lx\r\n", __FILE__, __LINE__, result);
    }
}

static void cy_udp_receive_callback(NX_UDP_SOCKET *socket)
{
    cy_rslt_t result;

    result = cy_worker_thread_enqueue(&socket_worker, cy_process_udp_receive_event, (void *)socket);
    if (result != CY_RSLT_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_worker_thread_enqueue failed at file: %s line: %d with error: 0x%lx\r\n", __FILE__, __LINE__, result);
    }
}

/*-----------------------------------------------------------*/
/*
 * @brief Network send helper function. Function call to this function should be protected by socket_mutex.
 */
static cy_rslt_t network_send(void *context, const unsigned char *data_buffer, uint32_t data_buffer_length, uint32_t *bytes_sent)
{
    UINT ret = NX_SUCCESS;
    cy_socket_ctx_t *ctx = (cy_socket_ctx_t *)context;
    NX_PACKET *packet;
    cy_rslt_t result;
    uint32_t size;

    *bytes_sent = 0;

    /*
     * This routine should never be called for UDP sockets.
     */

    if (ctx->transport_protocol == CY_SOCKET_IPPROTO_UDP)
    {
        return CY_RSLT_MODULE_SECURE_SOCKETS_PROTOCOL_NOT_SUPPORTED;
    }

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    while (data_buffer_length - (int32_t) *bytes_sent > 0)
    {
        result = cy_network_get_packet(CY_NETWORK_TCP_PACKET, DEFAULT_PACKET_ALLOCATE_TIMEOUT, (void *)&packet);
        if (result != CY_RSLT_SUCCESS)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_netxduo_get_packet failed with error %d\n", result);
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
        }

        /*
         * Make sure we aren't trying to send more data than we have room for in the packet.
         */

        size = data_buffer_length - *bytes_sent;
        if (size > (uint32_t)(packet->nx_packet_data_end - packet->nx_packet_prepend_ptr))
        {
            size = (uint32_t)(packet->nx_packet_data_end - packet->nx_packet_prepend_ptr);
        }

        memcpy(packet->nx_packet_prepend_ptr, &data_buffer[*bytes_sent], size);
        packet->nx_packet_append_ptr = packet->nx_packet_prepend_ptr + size;
        packet->nx_packet_length     = (ULONG)(packet->nx_packet_append_ptr - packet->nx_packet_prepend_ptr);

        ret = nx_tcp_socket_send(ctx->nxd_socket.tcp, packet, ctx->nonblocking ? NX_NO_WAIT : NX_TIMEOUT(ctx->send_timeout));
        if (ret != NX_SUCCESS)
        {
            /*
             * Don't leak the packet.
             */
            nx_packet_release(packet);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "nx_tcp_socket_send failed with error 0x%02x\n", ret);
            return NXD_TO_CY_SECURE_SOCKETS_ERR(ret);
        }

