Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
        *bytes_sent += size;
    }

    return CY_RSLT_SUCCESS;
}

/*-----------------------------------------------------------*/
/*
 * @brief TLS network send callback.
 */
static cy_rslt_t tls_network_send_callback(void *context, const unsigned char *data_buffer, uint32_t data_buffer_length, uint32_t *bytes_sent)
{
    cy_rslt_t result;
    cy_socket_ctx_t *ctx;

    /* NetXSecure requires TCP socket, so We pass &ctx->nxd_socket.tcp in TLS parameters to CY TLS.
     * This send callback is invoked only for mbedTLS. Retrieve cy_socket_ctx_t pointer from  &ctx->nxd_socket.tcp.
     */

    ctx = CY_NETXDUO_GET_SOCKET_CONTEXT(context, cy_socket_ctx_t, tcp);

    result = network_send(ctx, data_buffer, data_buffer_length, bytes_sent);

    return secure_socket_to_tls_error(result);
}

/*-----------------------------------------------------------*/
/*
 * @brief Network receive helper function. Function call to this function should be protected by socket_mutex.
 */
static cy_rslt_t network_receive(void *context, unsigned char *buffer, uint32_t len, uint32_t *bytes_received)
{
    UINT ret = NX_SUCCESS;
    ULONG timeout;
    size_t total_received = 0;
    size_t toread = 0;
    size_t outoffset = 0;
    NX_PACKET *packet;
    uint8_t *data;
    uint16_t avail_data_length;
    uint16_t total_data_length;
    cy_rslt_t result;
    cy_socket_ctx_t *ctx = (cy_socket_ctx_t *)context;

    *bytes_received = 0;

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    do
    {
        if (!ctx->packet)
        {
            timeout = ctx->nonblocking ? NX_NO_WAIT : NX_TIMEOUT(ctx->recv_timeout);
            if (ctx->transport_protocol == CY_SOCKET_IPPROTO_UDP)
            {
                ret = nx_udp_socket_receive(ctx->nxd_socket.udp, &packet, timeout);
            }
            else
            {
                ret = nx_tcp_socket_receive(ctx->nxd_socket.tcp, &packet, timeout);
            }
            if (ret != NX_SUCCESS)
            {
                /* If some amount of data already received, return success with amount of bytes received, else return error. */
                if (total_received)
                {
                    break;
                }
                else
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "nx_socket_receive returned 0x%02x\n", ret);
                    return NXD_TO_CY_SECURE_SOCKETS_ERR(ret);
                }
            }

            if (packet->nx_packet_length == 0)
            {
                nx_packet_release(packet);
                ctx->packet = NULL;
                continue;
            }
            ctx->packet = packet;
            ctx->offset = 0;
        }

        do
        {
            result = nxd_packet_get_data(ctx->packet, ctx->offset, &data, &avail_data_length, &total_data_length);
            if (result != CY_RSLT_SUCCESS)
            {
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Error getting packet data (%d)\n", result);
                return CY_RSLT_MODULE_SECURE_SOCKETS_TCPIP_ERROR;
            }

            /*
             * This is the data left to read
             */

            toread = len - total_received;
            if (toread > avail_data_length)
            {
                toread = avail_data_length;
            }

            /*
             * Copy the data out
             */

            memcpy(buffer + outoffset, data, toread);
            ctx->offset += toread;

            /*
             * Keep track of the total received
             */

            total_received += toread;

            /*
             * Move the output pointer for the output buffer
             */

            outoffset += toread;

        } while (total_received < len && total_data_length > avail_data_length);

        /*
         * If we used up the current packet, we need to release it.
         * This will force another network read the next time through the loop.
         */

        if (ctx->offset >= ctx->packet->nx_packet_length)
        {
            nx_packet_release(ctx->packet);
            ctx->packet = NULL;
            ctx->offset = 0;
        }

    } while (total_received < len);

    *bytes_received = total_received;

    return CY_RSLT_SUCCESS;
}

/*-----------------------------------------------------------*/
/*
 * @brief TLS receive callback.
 */
static cy_rslt_t tls_network_receive_callback(void *context, unsigned char *buffer, uint32_t len, uint32_t *bytes_received)
{
    cy_rslt_t result;
    cy_socket_ctx_t *ctx;

    /* NetXSecure requires TCP socket, so we pass &ctx->nxd_socket.tcp in TLS parameters to CY TLS.
     * This send callback is invoked only for mbedTLS. Retrieve cy_socket_ctx_t pointer from  &ctx->nxd_socket.tcp.
     */
    ctx = CY_NETXDUO_GET_SOCKET_CONTEXT(context, cy_socket_ctx_t, tcp);

    result = network_receive(ctx, buffer, len, bytes_received);

    return secure_socket_to_tls_error(result);
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_init(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_worker_thread_params_t params;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_init Start\n");

    if (!init_ref_count)
    {
        result = cy_rtos_init_mutex(&socket_list_mutex);
        if (CY_RSLT_SUCCESS != result)
        {
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
        }

        result = cy_rtos_init_mutex(&accept_recv_event_mutex);
        if (CY_RSLT_SUCCESS != result)
        {
            cy_rtos_deinit_mutex(&socket_list_mutex);
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
        }

        memset(&multicast_info, 0 , sizeof(multicast_info));

        result = cy_rtos_init_mutex(&multicast_join_leave_mutex);
        if (CY_RSLT_SUCCESS != result)
        {
            cy_rtos_deinit_mutex(&socket_list_mutex);
            cy_rtos_deinit_mutex(&accept_recv_event_mutex);

            return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
        }

        /* Allocate memory for multicast member list. */
        multicast_info.multicast_member_list = (cy_socket_multicast_pair_t *)malloc(sizeof(cy_socket_multicast_pair_t) * SECURE_SOCKETS_MAX_MULTICAST_GROUPS);
        if (multicast_info.multicast_member_list == NULL)
        {
            cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "malloc failed for multicast member list\n");
            cy_rtos_deinit_mutex(&socket_list_mutex);
            cy_rtos_deinit_mutex(&accept_recv_event_mutex);
            cy_rtos_deinit_mutex(&multicast_join_leave_mutex);
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
        }

