Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
        memset(&params, 0, sizeof(params));
        params.name        = "Socket";
        params.priority    = CY_RTOS_PRIORITY_ABOVENORMAL;
        params.stack       = NULL;
        params.stack_size  = SECURE_SOCKETS_THREAD_STACKSIZE;
        params.num_entries = 0;

        /* create a worker thread */
        result = cy_worker_thread_create(&socket_worker, &params);
        if (result != CY_RSLT_SUCCESS)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Create Worker Thread returned:0x%lx\n", result);
            cy_rtos_deinit_mutex(&socket_list_mutex);
            cy_rtos_deinit_mutex(&accept_recv_event_mutex);
            cy_rtos_deinit_mutex(&multicast_join_leave_mutex);
            if (multicast_info.multicast_member_list)
            {
                free(multicast_info.multicast_member_list);
                multicast_info.multicast_member_list = NULL;
            }
            return result;
        }
        /* Initialized the TLS library */
        result = cy_tls_init();
        if (result != CY_RSLT_SUCCESS)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_tls_init returned:0x%lx\n", result);
            cy_rtos_deinit_mutex(&socket_list_mutex);
            cy_rtos_deinit_mutex(&accept_recv_event_mutex);
            cy_rtos_deinit_mutex(&multicast_join_leave_mutex);
            if (multicast_info.multicast_member_list)
            {
                free(multicast_info.multicast_member_list);
                multicast_info.multicast_member_list = NULL;
            }
            cy_worker_thread_delete(&socket_worker);
            return result;
        }
        init_ref_count++;
    }
    else
    {
        init_ref_count++;
    }
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_init End\n");

    return result;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_create(int domain, int type, int protocol, cy_socket_t *handle)
{
    cy_socket_ctx_t *ctx;
    NX_IP *netif;
    UINT status;
    cy_socket_interface_t iface_type = CY_SOCKET_STA_INTERFACE;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_create Start\n");

    if (handle == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "NULL handle\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

#if !defined(NX_DISABLE_IPV6) && !defined(NX_DISABLE_IPV4)
    if ( (domain != CY_SOCKET_DOMAIN_AF_INET) && (domain != CY_SOCKET_DOMAIN_AF_INET6) )
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid domain\n");
        *handle = CY_SOCKET_INVALID_HANDLE;
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }
#else
#if !defined(NX_DISABLE_IPV4)
    if (domain != CY_SOCKET_DOMAIN_AF_INET)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid domain\n");
        *handle = CY_SOCKET_INVALID_HANDLE;
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }
#elif !defined(NX_DISABLE_IPV6)
    if (domain != CY_SOCKET_DOMAIN_AF_INET6)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid domain\n");
        *handle = CY_SOCKET_INVALID_HANDLE;
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }
#else
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "NX_DISABLE_IPV6 and NX_DISABLE_IPV4 are both defined\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BAD_NW_STACK_CONFIGURATION;
    }
#endif
#endif /* !defined(NX_DISABLE_IPV6) && !defined(NX_DISABLE_IPV4) */

    if ( !( ( (type == CY_SOCKET_TYPE_STREAM) && (protocol == CY_SOCKET_IPPROTO_TCP || protocol == CY_SOCKET_IPPROTO_TLS) ) ||
            ( (type == CY_SOCKET_TYPE_DGRAM)  && (protocol == CY_SOCKET_IPPROTO_UDP) ) ) )
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid type/protocol combination\n");
        *handle = CY_SOCKET_INVALID_HANDLE;
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    netif = cy_network_get_nw_interface(CY_NETWORK_WIFI_STA_INTERFACE, 0);
    if (netif == NULL)
    {
        /* STA interface is not created, it can be AP only mode check if AP netif exists */
        netif = cy_network_get_nw_interface(CY_NETWORK_WIFI_AP_INTERFACE, 0);
        if (netif == NULL)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid network interface\n");
            *handle = CY_SOCKET_INVALID_HANDLE;
            return CY_RSLT_MODULE_SECURE_SOCKETS_NETIF_DOES_NOT_EXIST;
        }
        iface_type = CY_SOCKET_AP_INTERFACE;
    }

    ctx = alloc_socket(protocol, iface_type);
    if (ctx == NULL)
    {
        *handle = CY_SOCKET_INVALID_HANDLE;
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "alloc_socket failed\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
    }

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    if (protocol == CY_SOCKET_IPPROTO_TCP || protocol == CY_SOCKET_IPPROTO_TLS)
    {
        ctx->is_authmode_set = false;
        if (protocol == CY_SOCKET_IPPROTO_TLS)
        {
            ctx->enforce_tls = true;
            /* Set the default TLS authentication mode to verify required. */
            ctx->auth_mode = CY_SOCKET_TLS_VERIFY_REQUIRED;
        }

        status = nx_tcp_socket_create(netif, ctx->nxd_socket.tcp, (CHAR*)"", NX_IP_NORMAL, FRAGMENT_OPTION, NX_IP_TIME_TO_LIVE, DEFAULT_TCP_WINDOW_SIZE, NX_NULL, cy_tcp_disconnect_callback);
        if (status == NX_SUCCESS)
        {
            ctx->nxd_socket.tcp->nx_tcp_socket_reserved_ptr = (void *)ctx->id;
            nx_tcp_socket_receive_notify(ctx->nxd_socket.tcp, cy_tcp_receive_callback);
        }
    }
    else
    {
        status = nx_udp_socket_create(netif, ctx->nxd_socket.udp, (char*)"", 0, FRAGMENT_OPTION, 255, DEFAULT_UDP_QUEUE_SIZE);
        if (status == NX_SUCCESS)
        {
            ctx->nxd_socket.udp->nx_udp_socket_reserved_ptr = (void *)ctx->id;
            nx_udp_socket_receive_notify(ctx->nxd_socket.udp, cy_udp_receive_callback);
        }
    }

    if (status != NX_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_socket_create failed\n");
        free_socket(ctx);
        return CY_RSLT_MODULE_SECURE_SOCKETS_TCPIP_ERROR;
    }

    ctx->recv_timeout = DEFAULT_RECV_TIMEOUT_IN_MSEC;
    ctx->send_timeout = DEFAULT_SEND_TIMEOUT_IN_MSEC;

    *handle = ctx;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_create End\n");
    return CY_RSLT_SUCCESS;
}


/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_setsockopt(cy_socket_t handle, int level, int optname, const void *optval, uint32_t optlen)
{
    cy_socket_ctx_t *ctx = NULL;
    cy_socket_opt_callback_t *callback_opt;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_setsockopt Start\n");
    if (CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }
    if ( ((level < CY_SOCKET_SOL_SOCKET) || (level > CY_SOCKET_SOL_IP)) ||
         ((optval == NULL) && (optname != CY_SOCKET_SO_CONNECT_REQUEST_CALLBACK) && (optname != CY_SOCKET_SO_RECEIVE_CALLBACK) && (optname != CY_SOCKET_SO_DISCONNECT_CALLBACK)) ||
         ((optval != NULL) && (optlen == 0)) )
    {
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    ctx = (cy_socket_ctx_t *)handle;

