Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
                        while (*ptr != ',' && *ptr != '\0')
                        {
                            ptr++;
                            if (*ptr == ',')
                            {
                                *ptr++ = '\0';
                                break;
                            }
                        }
                    }
                    ctx->alpn_list[i] = NULL;
                    break;
                }
#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
                case CY_SOCKET_SO_ROOTCA_CERTIFICATE_LOCATION:
                {
                    uint8_t load_rootca_location = *((uint8_t *)optval);

                    if (load_rootca_location != CY_SOCKET_ROOTCA_SECURE_STORAGE && load_rootca_location != CY_SOCKET_ROOTCA_RAM)
                    {
                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    ctx->load_rootca_from_ram = load_rootca_location;
                    break;
                }
                case CY_SOCKET_SO_DEVICE_CERT_KEY_LOCATION:
                {
                    uint8_t load_device_cert_key_location = *((uint8_t *)optval);

                    if (load_device_cert_key_location != CY_SOCKET_DEVICE_CERT_KEY_SECURE_STORAGE && load_device_cert_key_location != CY_SOCKET_DEVICE_CERT_KEY_RAM)
                    {
                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    ctx->load_device_cert_key_from_ram = load_device_cert_key_location;
                    break;
                }
#endif
                default:
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid Socket option = [%d]\n", optname);

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_OPTION;
                }
            }
            break;

        case CY_SOCKET_SOL_SOCKET:
            switch (optname)
            {
                case CY_SOCKET_SO_RCVTIMEO:
                {
                    ctx->recv_timeout = *((uint32_t *)optval);
                    ctx->is_recvtimeout_set = true;
                    break;
                }

                case CY_SOCKET_SO_SNDTIMEO:
                {
                    ctx->send_timeout = *((uint32_t *)optval);
                    break;
                }

                case CY_SOCKET_SO_NONBLOCK:
                {
                    ctx->nonblocking = *((uint8_t *)optval);
                    break;
                }

                case CY_SOCKET_SO_TCP_KEEPALIVE_ENABLE:
                {
                    int keep_alive = *((int *)optval);

                    if (keep_alive == 0 || keep_alive == 1)
                    {
                        if (ctx->transport_protocol == CY_SOCKET_IPPROTO_UDP)
                        {
                            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid socket type\n");

                            cy_rtos_set_mutex(&ctx->socket_mutex);
                            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                            return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                        }
#ifdef NX_ENABLE_TCP_KEEPALIVE
                        if (keep_alive)
                        {
                            ctx->nxd_socket.tcp->nx_tcp_socket_keepalive_enabled = NX_TRUE;
                        }
                        else
                        {
                            ctx->nxd_socket.tcp->nx_tcp_socket_keepalive_enabled = NX_FALSE;
                        }
#else
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "TCP keepalive not enabled\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
#endif
                    }
                    else
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid option value\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }
                    break;
                }

                case CY_SOCKET_SO_BROADCAST:
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Incompatible Socket option\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }

                case CY_SOCKET_SO_RECEIVE_CALLBACK:
                {
                    if (optval != NULL)
                    {
                        callback_opt = (cy_socket_opt_callback_t *) optval;

                        /*
                         * cy_process_receive_event function accesses ctx->callbacks.receive.callback, so we should protect initialization of
                         * ctx->callbacks.receive.callback pointer with mutex.
                         */
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex locked %s %d\n", __FILE__, __LINE__);
                        cy_rtos_get_mutex(&accept_recv_event_mutex, CY_RTOS_NEVER_TIMEOUT);

                        ctx->callbacks.receive.callback = callback_opt->callback;
                        ctx->callbacks.receive.arg      = callback_opt->arg;

                        cy_rtos_set_mutex(&accept_recv_event_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\n", __FILE__, __LINE__);
                    }
                    else
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex locked %s %d\n", __FILE__, __LINE__);
                        cy_rtos_get_mutex(&accept_recv_event_mutex, CY_RTOS_NEVER_TIMEOUT);

                        ctx->callbacks.receive.callback = NULL;

                        cy_rtos_set_mutex(&accept_recv_event_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\n", __FILE__, __LINE__);
                    }
                    break;
                }

