Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
                case CY_SOCKET_SO_DISCONNECT_CALLBACK:
                {
                    if (optval != NULL)
                    {
                        callback_opt = (cy_socket_opt_callback_t *) optval;
                        ctx->callbacks.disconnect.callback = callback_opt->callback;
                        ctx->callbacks.disconnect.arg      = callback_opt->arg;
                    }
                    else
                    {
                        ctx->callbacks.disconnect.callback = NULL;
                    }
                    break;
                }
                case CY_SOCKET_SO_CONNECT_REQUEST_CALLBACK:
                {
                    if (optval != NULL)
                    {
                        callback_opt = (cy_socket_opt_callback_t *)optval;
                        ctx->callbacks.connect_request.callback = callback_opt->callback;
                        ctx->callbacks.connect_request.arg      = callback_opt->arg;
                    }
                    else
                    {
                        ctx->callbacks.connect_request.callback = NULL;
                    }
                    break;
                }

                case CY_SOCKET_SO_BINDTODEVICE:
                {
                    cy_socket_interface_t iface_type = ( *(cy_socket_interface_t *)optval);
                    UINT status = NX_SUCCESS;

                    if ( (ctx->status & SOCKET_STATUS_FLAG_CONNECTED) ||
                         (ctx->status & SOCKET_STATUS_FLAG_LISTENING) )
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket connected or listening\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_ALREADY_CONNECTED;
                    }

                    if (iface_type != ctx->iface_type)
                    {
                        NX_IP *netif;
                        cy_network_hw_interface_type_t hw_iface_type;

                        if (iface_type == CY_SOCKET_STA_INTERFACE)
                        {
                            hw_iface_type = CY_NETWORK_WIFI_STA_INTERFACE;
                        }
                        else
                        {
                            hw_iface_type = CY_NETWORK_WIFI_AP_INTERFACE;
                        }

                        netif = cy_network_get_nw_interface(hw_iface_type, 0);
                        if (netif == NULL)
                        {
                            cy_rtos_set_mutex(&ctx->socket_mutex);
                            return CY_RSLT_MODULE_SECURE_SOCKETS_NETIF_DOES_NOT_EXIST;
                        }
                        if (ctx->transport_protocol == CY_SOCKET_IPPROTO_TCP)
                        {
                            status = nx_tcp_socket_delete(ctx->nxd_socket.tcp);
                            if (status == NX_SUCCESS)
                            {
                                status = nx_tcp_socket_create(netif, ctx->nxd_socket.tcp, (CHAR*)"", NX_IP_NORMAL, FRAGMENT_OPTION, NX_IP_TIME_TO_LIVE, DEFAULT_TCP_WINDOW_SIZE, NX_NULL, cy_tcp_disconnect_callback);
                            }
                        }
                        else
                        {
                            status = nx_udp_socket_delete(ctx->nxd_socket.udp);
                            if (status == NX_SUCCESS)
                            {
                                status = nx_udp_socket_create(netif, ctx->nxd_socket.udp, (char*)"", 0, FRAGMENT_OPTION, 255, DEFAULT_UDP_QUEUE_SIZE);
                            }
                        }
                        ctx->iface_type = iface_type;
                    }

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    if (status != NX_SUCCESS)
                    {
                        return nxd_to_secure_socket_error(status);
                    }
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);
                    break;
                }

                default:
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid Socket option = [%d]\n", optname);

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_OPTION;
                }
            }
            break;

        case CY_SOCKET_SOL_TCP:
            switch (optname)
            {
                case CY_SOCKET_SO_TCP_KEEPALIVE_INTERVAL:
                {
                    /*
                     * NetXDuo uses a compile time define, NX_TCP_KEEPALIVE_RETRY, to specify
                     * the number of seconds between retries of the keepalive timer assuming
                     * the other side of the connection is not responding.
                     */
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket option not supported\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }

                case CY_SOCKET_SO_TCP_KEEPALIVE_COUNT:
                {
                    /*
                     * NetXDuo uses a compile time define, NX_TCP_KEEPALIVE_RETRIES, to specify
                     * how many keepalive retries are allowed before the connection is deemed broken.
                     */
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket option not supported\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }

                case CY_SOCKET_SO_TCP_KEEPALIVE_IDLE_TIME:
                {
                    /*
                     * NetXDuo uses a compile time define, NX_TCP_KEEPALIVE_INITIAL, to specify
                     * the number of seconds of inactivity before the keepalive timer activates.
                     */
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket option not supported\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }

                case CY_SOCKET_SO_TCP_NODELAY:
                {
                    /*
                     * NetXDuo TCP ACK behavior set at compile time.
                     */
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket option not supported\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }
                default:
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid Socket option = [%d]\r\n", optname);

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

