Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
                    return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_OPTION;
                }
            }
            break;

        case CY_SOCKET_SOL_IP:
            switch (optname)
            {
                case CY_SOCKET_SO_JOIN_MULTICAST_GROUP:
                case CY_SOCKET_SO_LEAVE_MULTICAST_GROUP:
                {
                    NXD_ADDRESS if_addr;
                    NXD_ADDRESS multi_addr;
                    int member_index;
                    UINT err = NX_SUCCESS;
                    cy_rslt_t result = CY_RSLT_SUCCESS;
                    const cy_socket_ip_mreq_t *imr = (const cy_socket_ip_mreq_t *)optval;

                    convert_secure_socket_to_nxd_ip_addr(&if_addr, &imr->if_addr);
                    convert_secure_socket_to_nxd_ip_addr(&multi_addr, &imr->multi_addr);

                    /* Check if the address to join/leave is a valid multiast address. */
                    if (!ip_addr_ismulticast(&multi_addr))
                    {
                        cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid multicast address\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    do
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "multicast_join_leave_mutex locked %s %d\n", __FILE__, __LINE__);
                        cy_rtos_get_mutex(&multicast_join_leave_mutex, CY_RTOS_NEVER_TIMEOUT);

                        if (imr->if_addr.version != imr->multi_addr.version)
                        {
                            cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "multicast group address type and interface address type are not same\n");
                            result = CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                            break;
                        }

                        member_index = find_multicast_member_index(ctx, imr);

                        if (optname == CY_SOCKET_SO_JOIN_MULTICAST_GROUP)
                        {
                            if (member_index != -1)
                            {
                                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "multicast_join_leave_mutex unlocked %s %d\n", __FILE__, __LINE__);
                                result = CY_RSLT_MODULE_SECURE_SOCKETS_ADDRESS_IN_USE;
                                break;
                            }

                            if (multicast_info.multicast_member_count == SECURE_SOCKETS_MAX_MULTICAST_GROUPS)
                            {
                                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Registered multicast member count is already reached maximum allowed count %s %d\n", __FILE__, __LINE__);
                                result = CY_RSLT_MODULE_SECURE_SOCKETS_MAX_MEMBERSHIP_ERROR;
                                break;
                            }

                            member_index = next_free_multicast_slot(0);

                            /* Call wifi-mw-core network activity function to resume the network stack. */
                            cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

#ifndef NX_DISABLE_IPV4
                            if (if_addr.nxd_ip_version == NX_IP_VERSION_V4)
                            {
                                err = nx_igmp_multicast_join(ctx->nxd_socket.udp->nx_udp_socket_ip_ptr, multi_addr.nxd_ip_address.v4);
                                if (err != NX_SUCCESS)
                                {
                                    cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_igmp_multicast_join failed with error 0x%02x\n", err);
                                    break;
                                }
                            }
#endif
#ifndef NX_DISABLE_IPV6
                            if (if_addr.nxd_ip_version == NX_IP_VERSION_V6)
                            {
                                err = nxd_ipv6_multicast_interface_join(ctx->nxd_socket.udp->nx_udp_socket_ip_ptr, &multi_addr, CY_NETWORK_PRIMARY_INTERFACE);
                                if (err != NX_SUCCESS)
                                {
                                    cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nxd_ipv6_multicast_interface_join failed with error 0x%02x\n", err);
                                    break;
                                }
                            }
#endif
                            set_multicast_slot_status_bit(member_index);
                            memcpy(&multicast_info.multicast_member_list[member_index].if_addr, &imr->if_addr, sizeof(imr->if_addr));
                            memcpy(&multicast_info.multicast_member_list[member_index].multi_addr, &imr->multi_addr, sizeof(imr->multi_addr));
                            multicast_info.multicast_member_list[member_index].socket = ctx;
                            multicast_info.multicast_member_count++;
                        }
                        else
                        {
                            if (member_index == -1)
                            {
                                result = CY_RSLT_MODULE_SECURE_SOCKETS_MULTICAST_ADDRESS_NOT_REGISTERED;
                                break;
                            }

                            clear_multicast_slot_status_bit(member_index);
                            multicast_info.multicast_member_count--;

                            /* Call wifi-mw-core network activity function to resume the network stack. */
                            cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

#ifndef NX_DISABLE_IPV4
                            if (if_addr.nxd_ip_version == NX_IP_VERSION_V4)
                            {
                                err = nx_igmp_multicast_leave(ctx->nxd_socket.udp->nx_udp_socket_ip_ptr, multi_addr.nxd_ip_address.v4);
                                if (err != NX_SUCCESS)
                                {
                                    cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_igmp_multicast_leave failed with error 0x%02x\n", err);
                                    break;
                                }
                            }
#endif
#ifndef NX_DISABLE_IPV6
                            if (if_addr.nxd_ip_version == NX_IP_VERSION_V6)
                            {
                                err = nxd_ipv6_multicast_interface_leave(ctx->nxd_socket.udp->nx_udp_socket_ip_ptr, &multi_addr, CY_NETWORK_PRIMARY_INTERFACE);
                                if (err != NX_SUCCESS)
                                {
                                    cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nxd_ipv6_multicast_interface_leave failed with error 0x%02x\n", err);
                                    break;
                                }
                            }
#endif
                        }
                    } while(0);

                    cy_rtos_set_mutex(&multicast_join_leave_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "multicast_join_leave_mutex unlocked %s %d\n", __FILE__, __LINE__);

