Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
    if (!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    /* While this function is running, application may delete the socket. Protect entire function with a mutex. */
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex locked %s %d\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->socket_mutex, CY_RTOS_NEVER_TIMEOUT);

    /* Connect not supported for UDP sockets */
    if (ctx->transport_protocol == CY_SOCKET_IPPROTO_UDP)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_socket_connect API is not supported for UDP sockets\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_SUPPORTED;
    }

    /* Check if socket is not yet bound to a local port */
    if (!ctx->nxd_socket.tcp->nx_tcp_socket_bound_next)
    {
        ret = nx_tcp_client_socket_bind(ctx->nxd_socket.tcp, NX_ANY_PORT, NX_TIMEOUT(DEFAULT_BIND_TIMEOUT));
        if (ret != NX_SUCCESS)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_tcp_client_socket_bind failed with error = 0x%02x\n", ret);
            result = NXD_TO_CY_SECURE_SOCKETS_ERR(ret);

            cy_rtos_set_mutex(&ctx->socket_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

            return result;
        }
    }

    memset(&remote, 0, sizeof(NXD_ADDRESS));

    /* convert IP format from secure socket to NetXDuo */
    result = convert_secure_socket_to_nxd_ip_addr(&remote, &address->ip_address);
    if (result != CY_RSLT_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed conversion from secure socket to NetXDuo\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return result;
    }

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    ret = nxd_tcp_client_socket_connect(ctx->nxd_socket.tcp, &remote, address->port, ctx->nonblocking ? NX_NO_WAIT : NX_TIMEOUT(ctx->send_timeout));
    if (ret != NX_SUCCESS)
    {
        nx_tcp_client_socket_unbind(ctx->nxd_socket.tcp);

        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nxd_tcp_client_socket_connect failed with error = 0x%02x\n", ret);
        result = NXD_TO_CY_SECURE_SOCKETS_ERR(ret);
        goto exit;
    }
    ctx->status |= SOCKET_STATUS_FLAG_CONNECTED;

    if (ctx->enforce_tls)
    {
        tls_params.context = &ctx->nxd_socket.tcp;
        tls_params.network_send = tls_network_send_callback;
        tls_params.network_recv = tls_network_receive_callback;
        tls_params.tls_identity = ctx->tls_identity;
        tls_params.rootca_certificate = ctx->rootca_certificate;
        tls_params.rootca_certificate_length = ctx->rootca_certificate_len;
        tls_params.auth_mode = ctx->auth_mode;
        tls_params.mfl_code  = ctx->mfl_code;
        tls_params.hostname  = ctx->hostname;
        tls_params.alpn_list = (const char**)ctx->alpn_list;
#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
        tls_params.load_rootca_from_ram = ctx->load_rootca_from_ram;
        tls_params.load_device_cert_key_from_ram = ctx->load_device_cert_key_from_ram;
#endif
        result = cy_tls_create_context(&ctx->tls_ctx, &tls_params);
        if (result != CY_RSLT_SUCCESS)
        {
            nx_tcp_socket_disconnect(ctx->nxd_socket.tcp, ctx->nonblocking ? NX_NO_WAIT : NX_TIMEOUT(ctx->send_timeout));
            nx_tcp_client_socket_unbind(ctx->nxd_socket.tcp);
            ctx->status &= ~(SOCKET_STATUS_FLAG_CONNECTED);

            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_tls_create_context failed with error %lu\n", result);
            result = TLS_TO_CY_SECURE_SOCKETS_ERR(result);
            goto exit;
        }
        result = cy_tls_connect(ctx->tls_ctx, CY_TLS_ENDPOINT_CLIENT, ctx->send_timeout);
        if (result != CY_RSLT_SUCCESS)
        {
            nx_tcp_socket_disconnect(ctx->nxd_socket.tcp, ctx->nonblocking ? NX_NO_WAIT : NX_TIMEOUT(ctx->send_timeout));
            nx_tcp_client_socket_unbind(ctx->nxd_socket.tcp);
            ctx->status &= ~(SOCKET_STATUS_FLAG_CONNECTED);

            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_tls_connect failed with error %lu\n", result);
            result = TLS_TO_CY_SECURE_SOCKETS_ERR(result);
            goto exit;
        }
        ctx->status |= SOCKET_STATUS_FLAG_SECURED;
    }

exit:
    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_connect End\n");

    return result;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_disconnect(cy_socket_t handle, uint32_t timeout)
{
    cy_socket_ctx_t *ctx;
    UINT error;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_disconnect Start\n");
    if (CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }
    ctx = (cy_socket_ctx_t *)handle;

    if (!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    /* While this function is running, application may delete the socket. Protect entire function with a mutex. */
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex locked %s %d\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->socket_mutex, CY_RTOS_NEVER_TIMEOUT);

    if (ctx->transport_protocol == CY_SOCKET_IPPROTO_UDP)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_socket_disconnect API is not supported for UDP sockets\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_SUPPORTED;
    }

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    if (ctx->role == CY_TLS_ENDPOINT_CLIENT)
    {
        if ((ctx->status & SOCKET_STATUS_FLAG_CONNECTED) != SOCKET_STATUS_FLAG_CONNECTED)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Socket not connected\n");

            cy_rtos_set_mutex(&ctx->socket_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

            return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_CONNECTED;
        }

