Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
    if (dest_addr == NULL || buffer == NULL || bytes_sent == NULL || length == 0)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "dest_addr or buffer or bytes_sent pointers are NULL or length is zero\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    *bytes_sent = 0;

    ctx = (cy_socket_ctx_t *)handle;

    if (!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    /* While this function is running, application may delete the socket. Protect entire function with a mutex. */
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex locked %s %d\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->socket_mutex, CY_RTOS_NEVER_TIMEOUT);

    if (ctx->transport_protocol == CY_SOCKET_IPPROTO_TCP || ctx->transport_protocol == CY_SOCKET_IPPROTO_TLS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_socket_sendto API is not supported for TCP/TLS sockets\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_SUPPORTED;
    }

    memset(&remote, 0, sizeof(remote));

    /* convert IP format from secure socket to LWIP */
    result = convert_secure_socket_to_nxd_ip_addr(&remote, &dest_addr->ip_address);
    if (result != CY_RSLT_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed conversion from secure socket to NetXDuo\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return result;
    }

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    /* Create a packet buffer */
    result = cy_network_get_packet(CY_NETWORK_UDP_PACKET, DEFAULT_PACKET_ALLOCATE_TIMEOUT, (void *)&packet);
    if (result != CY_RSLT_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_netxduo_get_packet failed with error %d\n", result);

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
    }

    /* Get packet pool to allocate a packet */
    result = cy_network_get_packet_pool(CY_NETWORK_PACKET_TX, (void *)&packet_pool);
    if (result != CY_RSLT_SUCCESS)
    {
        nx_packet_release(packet);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_network_get_packet_pool failed: 0x%x\n", result);
        return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
    }

    /* Add data to the packet's payload. 
     * The below API will automatically perform packet chaining, if enabled. If there isn't enough
     * packets available in the packet pool for the amount of data to be sent, it will immediately
     * return with error.
     */
    err = nx_packet_data_append(packet, (void *)buffer, length, packet_pool, ctx->nonblocking ? NX_NO_WAIT : NX_TIMEOUT(ctx->send_timeout));
    if(err != NX_SUCCESS)
    {
        nx_packet_release(packet);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_packet_data_append failed with error 0x%02x\n", err);
        return NXD_TO_CY_SECURE_SOCKETS_ERR(err);
    }

     /*
     * Check if socket is bound. NetXDuo requires that the socket be bound to a port.
     */
    if (ctx->nxd_socket.udp->nx_udp_socket_bound_next == NULL)
    {
        /*
         * Not bound. We'll be nice and bind to a port automatically since LwIP
         * doesn't require that the UDP be bound.
         */
        nx_udp_socket_bind(ctx->nxd_socket.udp, NX_ANY_PORT, NX_TIMEOUT(DEFAULT_BIND_TIMEOUT));
    }

    /* Send data */
    err = nxd_udp_socket_send(ctx->nxd_socket.udp, packet, &remote, dest_addr->port);
    if (err != NX_SUCCESS)
    {
        nx_packet_release(packet);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nxd_udp_socket_send failed with error 0x%02x\n", err);

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return NXD_TO_CY_SECURE_SOCKETS_ERR(err);
    }

    *bytes_sent = length;

    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_sendto End\n");

    return CY_RSLT_SUCCESS;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_recv(cy_socket_t handle, void *data, uint32_t size, int flags, uint32_t *bytes_received)
{
    cy_socket_ctx_t *ctx;
    cy_rslt_t ret;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_recv Start\n");
    if (CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    /* buffer cannot be null or buffer length cannot be 0 */
    if (data == NULL || size == 0)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Buffer passed is NULL or buffer length is passed as 0\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    if (bytes_received == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "bytes_received passed as NULL\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    ctx = (cy_socket_ctx_t *)handle;

    if (!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    /* While this function is running, application may delete the socket. Protect entire function with a mutex. */
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex locked %s %d\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->socket_mutex, CY_RTOS_NEVER_TIMEOUT);

