Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
        /*
         * Extract the sender's address.
         */

        nxd_udp_source_extract(packet, &addr, &port);

        if (src_filter_set == true)
        {
            /*
             * Make sure the sender is the one we want.
             */

            if (!ip_addrs_same(&addr, &remote) || port != src_addr->port)
            {
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Sender addr doesn't match src_filter\n");
                continue;
            }
        }
    } while (0);

    /* convert IP format from LWIP to secure socket */
    result = convert_nxd_to_secure_socket_ip_addr(&peer_addr.ip_address, &addr);
    if(result != CY_RSLT_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed conversion from NetXDuo to secure socket\n");
        goto exit;
    }
    peer_addr.port = port;

    /* Copy the data from the packet to the caller's buffer */
    *bytes_received = (uint32_t)(packet->nx_packet_length); // nx_packet_length indicates total number of bytes received to be read
    if (*bytes_received > length)
    {
        *bytes_received = length;
    }

    memcpy(buffer, packet->nx_packet_prepend_ptr, *bytes_received);

    /* Copy source address */
    if (src_addr != NULL)
    {
        memcpy(src_addr, &peer_addr, sizeof(cy_socket_sockaddr_t));
    }

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_recvfrom End\n");

exit:
    if (packet != NULL)
    {
        nx_packet_release(packet);
        packet = NULL;
    }

    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_recvfrom End\n");

    return result;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_gethostbyname(const char *hostname, cy_socket_ip_version_t ip_ver, cy_socket_ip_address_t *addr)
{
    cy_rslt_t result;
    NXD_ADDRESS ip_address;
    ULONG lookup_type;
    bool ip_found = false;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_gethostbyname Start\n");
    if ((NULL == hostname) || (NULL == addr))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid arg\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    lookup_type = (ip_ver == CY_SOCKET_IP_VER_V4 ? NX_IP_VERSION_V4 : NX_IP_VERSION_V6);

    if (ip_ver == CY_SOCKET_IP_VER_V6)
    {
#ifndef NX_DISABLE_IPV6
        lookup_type = NX_IP_VERSION_V6;
#else
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "IPV6 not enabled\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
#endif
    }
    else if (ip_ver == CY_SOCKET_IP_VER_V4)
    {
#ifndef NX_DISABLE_IPV4
        lookup_type = NX_IP_VERSION_V4;
#else
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "IPV4 not enabled\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
#endif
    }
    else
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid IP version type\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    if (lookup_type == NX_IP_VERSION_V4)
    {
        uint32_t ip_addr = 0;

        /*
         * Check to see if we've been given an IP address string for the hostname.
         */

        ip_found = str_to_ip(hostname, &ip_addr);
        if (ip_found)
        {
            /*
             * NetXDuo addresses need to be in host byte order.
             */

            ip_address.nxd_ip_version    = NX_IP_VERSION_V4;
            ip_address.nxd_ip_address.v4 = ntohl(ip_addr);
        }
    }
#ifndef NX_DISABLE_IPV6
    if (lookup_type == NX_IP_VERSION_V6)
    {
        uint32_t ipv6_addr[4]={0,0,0,0};
        ip_found = str_to_ipv6(hostname, ipv6_addr);

        if (ip_found)
        {
            ip_address.nxd_ip_version    = NX_IP_VERSION_V6;

            ip_address.nxd_ip_address.v6[0] = ipv6_addr[0];
            ip_address.nxd_ip_address.v6[1] = ipv6_addr[1];
            ip_address.nxd_ip_address.v6[2] = ipv6_addr[2];
            ip_address.nxd_ip_address.v6[3] = ipv6_addr[3];
        }
    }
#endif
    if (!ip_found)
    {
        /* Call wifi-mw-core network activity function to resume the network stack. */
        cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

        result = cy_network_get_hostbyname(CY_NETWORK_WIFI_STA_INTERFACE, (UCHAR *)hostname, lookup_type, DEFAULT_DNS_TIMEOUT, &ip_address);
        if (result != CY_RSLT_SUCCESS)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_netxduo_get_hostbyname failed with error code %d\n", result);
            return CY_RSLT_MODULE_SECURE_SOCKETS_HOST_NOT_FOUND;
        }
    }

    /* convert IP format from NXD to secure socket */
    result = convert_nxd_to_secure_socket_ip_addr(addr, &ip_address);
    if (result != CY_RSLT_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed conversion from NetXDuo to secure socket\n");
        return result;
    }

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_gethostbyname End\n");

    return CY_RSLT_SUCCESS;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_poll(cy_socket_t handle, uint32_t *rwflags, uint32_t timeout)
{
    cy_socket_ctx_t *ctx;
    uint32_t flags;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    ULONG recv_avail = 0;
    bool send_avail = false;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_poll Start\n");
    if (CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    if (rwflags == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "rwflags pointer passed is NULL\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    ctx = (cy_socket_ctx_t *)handle;

    if (!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

