Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
    /* While this function is running, application may delete the socket. Protect entire function with a mutex. */
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex locked %s %d\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->socket_mutex, CY_RTOS_NEVER_TIMEOUT);

    flags = *rwflags;
    *rwflags = 0;

    if ( ( ctx->transport_protocol != CY_SOCKET_IPPROTO_UDP ) &&
         !( ( !ctx->enforce_tls && ( ctx->status & SOCKET_STATUS_FLAG_CONNECTED) ==  SOCKET_STATUS_FLAG_CONNECTED ) ||
         ( ( ctx->status & SOCKET_STATUS_FLAG_SECURED) ==  SOCKET_STATUS_FLAG_SECURED) ) )
    {
        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_CONNECTED;
    }

    if (flags & CY_SOCKET_POLL_READ)
    {
        if (ctx->transport_protocol == CY_SOCKET_IPPROTO_UDP)
        {
            nx_udp_socket_bytes_available(ctx->nxd_socket.udp, &recv_avail);
        }
        else
        {
            nx_tcp_socket_bytes_available(ctx->nxd_socket.tcp, &recv_avail);
        }
        if (recv_avail > 0 || ctx->packet)
        {
            *rwflags |= CY_SOCKET_POLL_READ;
        }
        else
        {
            while (timeout > 0)
            {
                if (ctx->transport_protocol == CY_SOCKET_IPPROTO_UDP)
                {
                    nx_udp_socket_bytes_available(ctx->nxd_socket.udp, &recv_avail);
                }
                else
                {
                    nx_tcp_socket_bytes_available(ctx->nxd_socket.tcp, &recv_avail);
                }
                if (recv_avail > 0 || ctx->packet)
                {
                    *rwflags |= CY_SOCKET_POLL_READ;
                    break ;
                }

                cy_rtos_delay_milliseconds(1);
                if (timeout != 0xffffffff)
                {
                    timeout--;
                }
            }
        }
    }

    if (flags & CY_SOCKET_POLL_WRITE)
    {
        if (ctx->transport_protocol == CY_SOCKET_IPPROTO_UDP)
        {
            send_avail = is_nx_udp_send_available(ctx->nxd_socket.udp);
        }
        else
        {
            send_avail = is_nx_tcp_send_available(ctx->nxd_socket.tcp);
        }
        if (send_avail)
        {
            *rwflags |= CY_SOCKET_POLL_WRITE;
        }
        else
        {
            while (timeout > 0)
            {
                if (ctx->transport_protocol == CY_SOCKET_IPPROTO_UDP)
                {
                    send_avail = is_nx_udp_send_available(ctx->nxd_socket.udp);
                }
                else
                {
                    send_avail = is_nx_tcp_send_available(ctx->nxd_socket.tcp);
                }
                if (send_avail > 0)
                {
                    *rwflags |= CY_SOCKET_POLL_WRITE;
                    break ;
                }

                cy_rtos_delay_milliseconds(1);
                if (timeout != 0xffffffff)
                {
                    timeout--;
                }
            }
        }
    }

    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_poll End\r\n");
    return result;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_delete(cy_socket_t handle)
{
    cy_socket_ctx_t *ctx;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_delete Start\r\n");
    if (CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }
    ctx = (cy_socket_ctx_t *) handle;

    if (!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    if (ctx->transport_protocol != CY_SOCKET_IPPROTO_UDP)
    {
        /* disconnect the socket */
        cy_socket_disconnect(ctx, 0);

        /*
         * Make sure we free up any resources which may have been allocated for the socket.
         * We don't check the return status since there's nothing we can do about it.
         */

        nx_tcp_server_socket_unaccept(ctx->nxd_socket.tcp);

        if (ctx->status & SOCKET_STATUS_FLAG_LISTENING)
        {
            nx_tcp_server_socket_unlisten(ctx->nxd_socket.tcp->nx_tcp_socket_ip_ptr, ctx->nxd_socket.tcp->nx_tcp_socket_port);
        }
        nx_tcp_client_socket_unbind(ctx->nxd_socket.tcp);
        nx_tcp_socket_delete(ctx->nxd_socket.tcp);

        if (ctx->hostname)
        {
            free(ctx->hostname);
            ctx->hostname = NULL;
        }

        /* free alpn string */
        if (ctx->alpn)
        {
            free(ctx->alpn);
            ctx->alpn = NULL;
        }

        /* free alpn array of strings */
        if (ctx->alpn_list)
        {
            free(ctx->alpn_list);
            ctx->alpn_list = NULL;
        }
    }
    else
    {
        int member_index = 0;
        int count = 0;
        int num_multicast_groups = 0;
        NXD_ADDRESS if_addr;
        NXD_ADDRESS multi_addr;
        UINT err = NX_SUCCESS;

        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "multicast_join_leave_mutex locked %s %d\n", __FILE__, __LINE__);
        cy_rtos_get_mutex(&multicast_join_leave_mutex, CY_RTOS_NEVER_TIMEOUT);

        /* Call wifi-mw-core network activity function to resume the network stack. */
        cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

        num_multicast_groups = multicast_info.multicast_member_count;
        while (count < num_multicast_groups)
        {
            member_index = next_registered_multicast_slot(member_index);

            if (multicast_info.multicast_member_list[member_index].socket == ctx)
            {
                convert_secure_socket_to_nxd_ip_addr(&if_addr, &multicast_info.multicast_member_list[member_index].if_addr);
                convert_secure_socket_to_nxd_ip_addr(&multi_addr, &multicast_info.multicast_member_list[member_index].multi_addr);

#ifndef NX_DISABLE_IPV4
                if (if_addr.nxd_ip_version == NX_IP_VERSION_V4)
                {
                    err = nx_igmp_multicast_leave(ctx->nxd_socket.udp->nx_udp_socket_ip_ptr, multi_addr.nxd_ip_address.v4);
                    if (err != NX_SUCCESS)
                    {
                        cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_igmp_multicast_leave failed with error 0x%02x\n", err);
                    }
                }
#endif
#ifndef NX_DISABLE_IPV6
                if (if_addr.nxd_ip_version == NX_IP_VERSION_V6)
                {
                    err = nxd_ipv6_multicast_interface_leave(ctx->nxd_socket.udp->nx_udp_socket_ip_ptr, &multi_addr, CY_NETWORK_PRIMARY_INTERFACE);
                    if (err != NX_SUCCESS)
                    {
                        cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nxd_ipv6_multicast_interface_leave failed with error 0x%02x\n", err);
                        break;
                    }
                }
#endif
                clear_multicast_slot_status_bit(member_index);
                multicast_info.multicast_member_count--;
            }
            member_index++;
            count++;
        }

        cy_rtos_set_mutex(&multicast_join_leave_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "multicast_join_leave_mutex unlocked %s %d\n", __FILE__, __LINE__);

