Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
        return NXD_TO_CY_SECURE_SOCKETS_ERR(result);
    }

    ctx->role = CY_TLS_ENDPOINT_SERVER;
    ctx->status |= SOCKET_STATUS_FLAG_LISTENING;

    /* If user has not set the authentication mode, set the default authentication mode to NONE. */
    if (!ctx->is_authmode_set)
    {
        ctx->auth_mode = CY_SOCKET_TLS_VERIFY_NONE;
    }

    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_listen End\n");

    return CY_RSLT_SUCCESS;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_accept(cy_socket_t handle, cy_socket_sockaddr_t *address, uint32_t *address_length, cy_socket_t *socket)
{
    cy_socket_ctx_t *ctx;
    cy_socket_ctx_t *accept_ctx;
    NX_TCP_SOCKET *tcp;
    cy_tls_params_t tls_params = { 0 };
    UINT result = NX_SUCCESS;
    cy_rslt_t ret;
    NXD_ADDRESS peer_addr;
    ULONG port;
    ULONG timeout;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_accept Start\n");
    if (socket == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Accepted client socket pointer is NULL\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    *socket = CY_SOCKET_INVALID_HANDLE;

    if (CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid server handle\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }
    ctx = (cy_socket_ctx_t *) handle;

    if (!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid server handle\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    /* While this function is running, application may delete the socket. Protect entire function with a mutex. */
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex locked %s %d\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->socket_mutex, CY_RTOS_NEVER_TIMEOUT);

    if (address == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Address passed as NULL\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    /* Check if this socket is in listening state or not */
    if (!(ctx->status &= SOCKET_STATUS_FLAG_LISTENING))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Server socket is not in listening state\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_LISTENING;
    }

    accept_ctx = alloc_socket(ctx->transport_protocol, ctx->iface_type);
    if (accept_ctx == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to allocate socket context for accepted client socket\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
    }

    /* Create the new socket */
    result = nx_tcp_socket_create(ctx->nxd_socket.tcp->nx_tcp_socket_ip_ptr, accept_ctx->nxd_socket.tcp, (CHAR*)"",
                                  NX_IP_NORMAL, FRAGMENT_OPTION, NX_IP_TIME_TO_LIVE, DEFAULT_TCP_WINDOW_SIZE, NX_NULL, cy_tcp_disconnect_callback);
    if (result != NX_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to create socket for accepted client socket: 0x%02x\n", result);

        free_socket(accept_ctx);

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
    }

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    timeout = ctx->nonblocking ? NX_NO_WAIT : NX_TIMEOUT(ctx->recv_timeout);

    /* If socket is nonblocking, ignore timeout */
    if (ctx->nonblocking)
    {
        result = nx_tcp_server_socket_accept(ctx->nxd_socket.tcp, NX_NO_WAIT);
    }
    else
    {
        /* If socket is blocking, and user set the timeout use the timeout set by user else wait for ever. */
        timeout = ctx->is_recvtimeout_set ? NX_TIMEOUT(ctx->recv_timeout) : NX_WAIT_FOREVER;

        result = nx_tcp_server_socket_accept(ctx->nxd_socket.tcp, timeout);
    }

    if (result != NX_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_tcp_server_socket_accept failed with error = 0x%02x\n", result);

        /* Cleanup from the failure */
        nx_tcp_server_socket_unaccept(ctx->nxd_socket.tcp);

        /* Set the socket back to listening */
        nx_tcp_server_socket_relisten(ctx->nxd_socket.tcp->nx_tcp_socket_ip_ptr, ctx->bind_port, ctx->nxd_socket.tcp);

        nx_tcp_socket_delete(accept_ctx->nxd_socket.tcp);
        free_socket(accept_ctx);

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return NXD_TO_CY_SECURE_SOCKETS_ERR(result);
    }

    /*
     * Get the peer socket information.
     */
    result = nxd_tcp_socket_peer_info_get(ctx->nxd_socket.tcp, &peer_addr, &port);
    if (result != NX_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "err getting peer info: 0x%02x\n", result);
    }

    /* Convert IP format from NetXDuo to secure socket */
    result = convert_nxd_to_secure_socket_ip_addr(&address->ip_address, &peer_addr);
    if (result != CY_RSLT_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed conversion from NetXDuo to secure socket\n");
        nx_tcp_server_socket_unaccept(ctx->nxd_socket.tcp);
        nx_tcp_client_socket_unbind(ctx->nxd_socket.tcp);
        /* Set the socket back to listening */
        nx_tcp_server_socket_relisten(ctx->nxd_socket.tcp->nx_tcp_socket_ip_ptr, ctx->bind_port, ctx->nxd_socket.tcp);
        nx_tcp_socket_delete(accept_ctx->nxd_socket.tcp);
        free_socket(accept_ctx);
        *socket = CY_SOCKET_INVALID_HANDLE;

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return result;
    }

    address->port   = port;
    *address_length = sizeof(*address);

    if (ctx->enforce_tls)
    {
        tls_params.context = &ctx->nxd_socket.tcp;
        tls_params.network_send = tls_network_send_callback;
        tls_params.network_recv = tls_network_receive_callback;
        tls_params.tls_identity = ctx->tls_identity;
        tls_params.auth_mode = ctx->auth_mode;

        accept_ctx->enforce_tls = 1;

