Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXDUO/cy_secure_sockets.c
        ret = cy_tls_create_context(&ctx->tls_ctx, &tls_params);
        if (ret != CY_RSLT_SUCCESS)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_tls_create_context failed with error %ld\n", ret);
            nx_tcp_server_socket_unaccept(ctx->nxd_socket.tcp);
            nx_tcp_client_socket_unbind(ctx->nxd_socket.tcp);
            /* Set the socket back to listening */
            nx_tcp_server_socket_relisten(ctx->nxd_socket.tcp->nx_tcp_socket_ip_ptr, ctx->bind_port, ctx->nxd_socket.tcp);
            nx_tcp_socket_delete(accept_ctx->nxd_socket.tcp);
            free_socket(accept_ctx);
            *socket = CY_SOCKET_INVALID_HANDLE;

            cy_rtos_set_mutex(&ctx->socket_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

            return TLS_TO_CY_SECURE_SOCKETS_ERR(ret);
        }

        ret = cy_tls_connect(ctx->tls_ctx, CY_TLS_ENDPOINT_SERVER, ctx->send_timeout);
        if (ret != CY_RSLT_SUCCESS)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_tls_connect failed with error %lu\n", ret);
            cy_tls_delete_context(ctx->tls_ctx);
            nx_tcp_server_socket_unaccept(ctx->nxd_socket.tcp);
            nx_tcp_client_socket_unbind(ctx->nxd_socket.tcp);
            /* Set the socket back to listening */
            nx_tcp_server_socket_relisten(ctx->nxd_socket.tcp->nx_tcp_socket_ip_ptr, ctx->bind_port, ctx->nxd_socket.tcp);
            nx_tcp_socket_delete(accept_ctx->nxd_socket.tcp);
            free_socket(accept_ctx);
            *socket = CY_SOCKET_INVALID_HANDLE;

            cy_rtos_set_mutex(&ctx->socket_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

            return TLS_TO_CY_SECURE_SOCKETS_ERR(ret);
        }
        accept_ctx->status |= SOCKET_STATUS_FLAG_SECURED;
        accept_ctx->tls_ctx = ctx->tls_ctx;
    }

    /*
     * Slight of hand. We want to swap the underlying sockets so that the connected socket is attached to
     * the newly created accept_ctx.
     */

    tcp = ctx->nxd_socket.tcp;
    ctx->nxd_socket.tcp = accept_ctx->nxd_socket.tcp;
    accept_ctx->nxd_socket.tcp = tcp;

    /* Set the newly created socket (not the one being returned) to listening on the port */
    result = nx_tcp_server_socket_relisten(ctx->nxd_socket.tcp->nx_tcp_socket_ip_ptr, ctx->bind_port, ctx->nxd_socket.tcp);
    if (result != NX_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_tcp_server_socket_relisten failed with error = 0x%02x\n", result);
    }

    /* Clear Listening state in connected client socket and set the newly created socket to be in Listening state */
    accept_ctx->status &= ~(SOCKET_STATUS_FLAG_LISTENING);
    ctx->status |= SOCKET_STATUS_FLAG_LISTENING;

    ctx->nxd_socket.tcp->nx_tcp_socket_reserved_ptr = (void *)ctx->id;
    nx_tcp_socket_receive_notify(ctx->nxd_socket.tcp, cy_tcp_receive_callback);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "new connection accepted\n");

    accept_ctx->nxd_socket.tcp->nx_tcp_socket_reserved_ptr = (void *)accept_ctx->id;
    accept_ctx->status |= SOCKET_STATUS_FLAG_CONNECTED;
    accept_ctx->nonblocking          = ctx->nonblocking;
    accept_ctx->recv_timeout         = ctx->recv_timeout;
    accept_ctx->send_timeout         = ctx->send_timeout;
    nx_tcp_socket_receive_notify(accept_ctx->nxd_socket.tcp, cy_tcp_receive_callback);

    /*
     * Ideally, the existing callbacks should not be copied. Typically the callers have 
     * added a callback argument for the callback event. If we copy the callback
     * info to the new socket, the callback argument will be same as that passed to the
     * the listening socket, instead of it being unique to the connected client socket.
     * This copying of callbacks is done here to keep the behavior uniform between LwIP and NetXDuo.
     * The below callbacks are just the default callbacks for the new client socket. They
     * can be overriden by any other callback and argument by the application.
    */

    accept_ctx->callbacks.disconnect = ctx->callbacks.disconnect;
    accept_ctx->callbacks.receive    = ctx->callbacks.receive;

    *socket = accept_ctx;

    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_accept End\n");
    return CY_RSLT_SUCCESS;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_shutdown(cy_socket_t handle, int how)
{
    (void)handle;
    (void)how;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_socket_shutdown call not suppoert for NetXDuo\n");
    return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_SUPPORTED;
}
